Autodesk.Revit.DB.FirstNumberFormattingOptions
Defines the formatting options for the start of a sequence.
Since:
2027
Since:
2027

Autodesk.Revit.DB.FirstNumberFormattingOptions.HideWhenSingle
Hide the first number only if there is a single number in the sequence.

Autodesk.Revit.DB.FirstNumberFormattingOptions.HideAndDecrement
Hide the first number and decrease the remaining numbers by one.

Autodesk.Revit.DB.FirstNumberFormattingOptions.ShowAll
Display all numbers in the sequence.